espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG27/Include/efr32bg27_dcdc.h
/* Bit fields for DCDC CCCMD */
#define _DCDC_CCCMD_RESETVALUE                        0x00000000UL                      /**< Default value for DCDC_CCCMD                */
#define _DCDC_CCCMD_MASK                              0x00000007UL                      /**< Mask for DCDC_CCCMD                         */
#define DCDC_CCCMD_START                              (0x1UL << 0)                      /**< Start CC                                    */
#define _DCDC_CCCMD_START_SHIFT                       0                                 /**< Shift value for DCDC_START                  */
#define _DCDC_CCCMD_START_MASK                        0x1UL                             /**< Bit mask for DCDC_START                     */
#define _DCDC_CCCMD_START_DEFAULT                     0x00000000UL                      /**< Mode DEFAULT for DCDC_CCCMD                 */
#define DCDC_CCCMD_START_DEFAULT                      (_DCDC_CCCMD_START_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCCMD         */
#define DCDC_CCCMD_STOP                               (0x1UL << 1)                      /**< Stop CC                                     */
#define _DCDC_CCCMD_STOP_SHIFT                        1                                 /**< Shift value for DCDC_STOP                   */
#define _DCDC_CCCMD_STOP_MASK                         0x2UL                             /**< Bit mask for DCDC_STOP                      */
#define _DCDC_CCCMD_STOP_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for DCDC_CCCMD                 */
#define DCDC_CCCMD_STOP_DEFAULT                       (_DCDC_CCCMD_STOP_DEFAULT << 1)   /**< Shifted mode DEFAULT for DCDC_CCCMD         */
#define DCDC_CCCMD_CLR                                (0x1UL << 2)                      /**< Clear CC                                    */
#define _DCDC_CCCMD_CLR_SHIFT                         2                                 /**< Shift value for DCDC_CLR                    */
#define _DCDC_CCCMD_CLR_MASK                          0x4UL                             /**< Bit mask for DCDC_CLR                       */
#define _DCDC_CCCMD_CLR_DEFAULT                       0x00000000UL                      /**< Mode DEFAULT for DCDC_CCCMD                 */
#define DCDC_CCCMD_CLR_DEFAULT                        (_DCDC_CCCMD_CLR_DEFAULT << 2)    /**< Shifted mode DEFAULT for DCDC_CCCMD         */

/* Bit fields for DCDC CCEM0CNT */
#define _DCDC_CCEM0CNT_RESETVALUE                     0x00000000UL                        /**< Default value for DCDC_CCEM0CNT             */
#define _DCDC_CCEM0CNT_MASK                           0xFFFFFFFFUL                        /**< Mask for DCDC_CCEM0CNT                      */
#define _DCDC_CCEM0CNT_CCCNT_SHIFT                    0                                   /**< Shift value for DCDC_CCCNT                  */
#define _DCDC_CCEM0CNT_CCCNT_MASK                     0xFFFFFFFFUL                        /**< Bit mask for DCDC_CCCNT                     */
#define _DCDC_CCEM0CNT_CCCNT_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for DCDC_CCEM0CNT              */
#define DCDC_CCEM0CNT_CCCNT_DEFAULT                   (_DCDC_CCEM0CNT_CCCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for DCDC_CCEM0CNT      */

/* Bit fields for DCDC CCEM2CNT */
#define _DCDC_CCEM2CNT_RESETVALUE                     0x00000000UL                        /**< Default value for DCDC_CCEM2CNT             */
#define _DCDC_CCEM2CNT_MASK                           0xFFFFFFFFUL                        /**< Mask for DCDC_CCEM2CNT                      */
#define _DCDC_CCEM2CNT_CCCNT_SHIFT                    0                                   /**< Shift value for DCDC_CCCNT                  */
#define _DCDC_CCEM2CNT_CCCNT_MASK                     0xFFFFFFFFUL                        /**< Bit mask for DCDC_CCCNT                     */
#define _DCDC_CCEM2CNT_CCCNT_DEFAULT                  0x00000000UL                        /**< Mode DEFAULT for DCDC_CCEM2CNT              */
#define DCDC_CCEM2CNT_CCCNT_DEFAULT                   (_DCDC_CCEM2CNT_CCCNT_DEFAULT << 0) /**< Shifted mode DEFAULT for DCDC_CCEM2CNT      */

/* Bit fields for DCDC CCTHR */
#define _DCDC_CCTHR_RESETVALUE                        0x00010001UL                       /**< Default value for DCDC_CCTHR                */
#define _DCDC_CCTHR_MASK                              0xFFFFFFFFUL                       /**< Mask for DCDC_CCTHR                         */
#define _DCDC_CCTHR_EM0CNT_SHIFT                      0                                  /**< Shift value for DCDC_EM0CNT                 */
#define _DCDC_CCTHR_EM0CNT_MASK                       0xFFFFUL                           /**< Bit mask for DCDC_EM0CNT                    */
#define _DCDC_CCTHR_EM0CNT_DEFAULT                    0x00000001UL                       /**< Mode DEFAULT for DCDC_CCTHR                 */
#define DCDC_CCTHR_EM0CNT_DEFAULT                     (_DCDC_CCTHR_EM0CNT_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCTHR         */
#define _DCDC_CCTHR_EM2CNT_SHIFT                      16                                 /**< Shift value for DCDC_EM2CNT                 */
#define _DCDC_CCTHR_EM2CNT_MASK                       0xFFFF0000UL                       /**< Bit mask for DCDC_EM2CNT                    */
#define _DCDC_CCTHR_EM2CNT_DEFAULT                    0x00000001UL                       /**< Mode DEFAULT for DCDC_CCTHR                 */
#define DCDC_CCTHR_EM2CNT_DEFAULT                     (_DCDC_CCTHR_EM2CNT_DEFAULT << 16) /**< Shifted mode DEFAULT for DCDC_CCTHR         */

/* Bit fields for DCDC CCIF */
#define _DCDC_CCIF_RESETVALUE                         0x00000000UL                       /**< Default value for DCDC_CCIF                 */
#define _DCDC_CCIF_MASK                               0x0000000FUL                       /**< Mask for DCDC_CCIF                          */
#define DCDC_CCIF_EM0OFIF                             (0x1UL << 0)                       /**< EM0 Counter Overflow                        */
#define _DCDC_CCIF_EM0OFIF_SHIFT                      0                                  /**< Shift value for DCDC_EM0OFIF                */
#define _DCDC_CCIF_EM0OFIF_MASK                       0x1UL                              /**< Bit mask for DCDC_EM0OFIF                   */
#define _DCDC_CCIF_EM0OFIF_DEFAULT                    0x00000000UL                       /**< Mode DEFAULT for DCDC_CCIF                  */
#define DCDC_CCIF_EM0OFIF_DEFAULT                     (_DCDC_CCIF_EM0OFIF_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCIF          */
#define DCDC_CCIF_EM2OFIF                             (0x1UL << 1)                       /**< EM2 Counter Overflow                        */
#define _DCDC_CCIF_EM2OFIF_SHIFT                      1                                  /**< Shift value for DCDC_EM2OFIF                */
#define _DCDC_CCIF_EM2OFIF_MASK                       0x2UL                              /**< Bit mask for DCDC_EM2OFIF                   */
#define _DCDC_CCIF_EM2OFIF_DEFAULT                    0x00000000UL                       /**< Mode DEFAULT for DCDC_CCIF                  */
#define DCDC_CCIF_EM2OFIF_DEFAULT                     (_DCDC_CCIF_EM2OFIF_DEFAULT << 1)  /**< Shifted mode DEFAULT for DCDC_CCIF          */
#define DCDC_CCIF_EM0CMPIF                            (0x1UL << 2)                       /**< EM0 Counter Compare Match                   */
#define _DCDC_CCIF_EM0CMPIF_SHIFT                     2                                  /**< Shift value for DCDC_EM0CMPIF               */
#define _DCDC_CCIF_EM0CMPIF_MASK                      0x4UL                              /**< Bit mask for DCDC_EM0CMPIF                  */
#define _DCDC_CCIF_EM0CMPIF_DEFAULT                   0x00000000UL                       /**< Mode DEFAULT for DCDC_CCIF                  */
#define DCDC_CCIF_EM0CMPIF_DEFAULT                    (_DCDC_CCIF_EM0CMPIF_DEFAULT << 2) /**< Shifted mode DEFAULT for DCDC_CCIF          */
#define DCDC_CCIF_EM2CMPIF                            (0x1UL << 3)                       /**< EM2 Counter Compare Match                   */
#define _DCDC_CCIF_EM2CMPIF_SHIFT                     3                                  /**< Shift value for DCDC_EM2CMPIF               */
#define _DCDC_CCIF_EM2CMPIF_MASK                      0x8UL                              /**< Bit mask for DCDC_EM2CMPIF                  */
#define _DCDC_CCIF_EM2CMPIF_DEFAULT                   0x00000000UL                       /**< Mode DEFAULT for DCDC_CCIF                  */
#define DCDC_CCIF_EM2CMPIF_DEFAULT                    (_DCDC_CCIF_EM2CMPIF_DEFAULT << 3) /**< Shifted mode DEFAULT for DCDC_CCIF          */

/* Bit fields for DCDC CCIEN */
#define _DCDC_CCIEN_RESETVALUE                        0x00000000UL                         /**< Default value for DCDC_CCIEN                */
#define _DCDC_CCIEN_MASK                              0x0000000FUL                         /**< Mask for DCDC_CCIEN                         */
#define DCDC_CCIEN_EM0OFIEN                           (0x1UL << 0)                         /**< Clmb Cntr EM0 Overflow Interrupt Enable     */
#define _DCDC_CCIEN_EM0OFIEN_SHIFT                    0                                    /**< Shift value for DCDC_EM0OFIEN               */
#define _DCDC_CCIEN_EM0OFIEN_MASK                     0x1UL                                /**< Bit mask for DCDC_EM0OFIEN                  */
#define _DCDC_CCIEN_EM0OFIEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DCDC_CCIEN                 */
#define DCDC_CCIEN_EM0OFIEN_DEFAULT                   (_DCDC_CCIEN_EM0OFIEN_DEFAULT << 0)  /**< Shifted mode DEFAULT for DCDC_CCIEN         */
#define DCDC_CCIEN_EM2OFIEN                           (0x1UL << 1)                         /**< Clmb Cntr EM2 Overflow Interrupt Enable     */
#define _DCDC_CCIEN_EM2OFIEN_SHIFT                    1                                    /**< Shift value for DCDC_EM2OFIEN               */
#define _DCDC_CCIEN_EM2OFIEN_MASK                     0x2UL                                /**< Bit mask for DCDC_EM2OFIEN                  */
#define _DCDC_CCIEN_EM2OFIEN_DEFAULT                  0x00000000UL                         /**< Mode DEFAULT for DCDC_CCIEN                 */
#define DCDC_CCIEN_EM2OFIEN_DEFAULT                   (_DCDC_CCIEN_EM2OFIEN_DEFAULT << 1)  /**< Shifted mode DEFAULT for DCDC_CCIEN         */
#define DCDC_CCIEN_EM0CMPIEN                          (0x1UL << 2)                         /**< Clmb Cntr EM0 Cmp Match Interrupt Enable    */
#define _DCDC_CCIEN_EM0CMPIEN_SHIFT                   2                                    /**< Shift value for DCDC_EM0CMPIEN              */
#define _DCDC_CCIEN_EM0CMPIEN_MASK                    0x4UL                                /**< Bit mask for DCDC_EM0CMPIEN                 */
#define _DCDC_CCIEN_EM0CMPIEN_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for DCDC_CCIEN                 */
#define DCDC_CCIEN_EM0CMPIEN_DEFAULT                  (_DCDC_CCIEN_EM0CMPIEN_DEFAULT << 2) /**< Shifted mode DEFAULT for DCDC_CCIEN         */
#define DCDC_CCIEN_EM2CMPIEN                          (0x1UL << 3)                         /**< Clmb Cntr EM2 Cmp Match Interrupt Enable    */
#define _DCDC_CCIEN_EM2CMPIEN_SHIFT                   3                                    /**< Shift value for DCDC_EM2CMPIEN              */
#define _DCDC_CCIEN_EM2CMPIEN_MASK                    0x8UL                                /**< Bit mask for DCDC_EM2CMPIEN                 */
#define _DCDC_CCIEN_EM2CMPIEN_DEFAULT                 0x00000000UL                         /**< Mode DEFAULT for DCDC_CCIEN                 */
#define DCDC_CCIEN_EM2CMPIEN_DEFAULT                  (_DCDC_CCIEN_EM2CMPIEN_DEFAULT << 3) /**< Shifted mode DEFAULT for DCDC_CCIEN         */

/* Bit fields for DCDC CCSTATUS */
#define _DCDC_CCSTATUS_RESETVALUE                     0x00000000UL                            /**< Default value for DCDC_CCSTATUS             */
#define _DCDC_CCSTATUS_MASK                           0x00000003UL                            /**< Mask for DCDC_CCSTATUS                      */
#define DCDC_CCSTATUS_CLRBSY                          (0x1UL << 0)                            /**< Coulomb Counter Clear Busy                  */
#define _DCDC_CCSTATUS_CLRBSY_SHIFT                   0                                       /**< Shift value for DCDC_CLRBSY                 */
#define _DCDC_CCSTATUS_CLRBSY_MASK                    0x1UL                                   /**< Bit mask for DCDC_CLRBSY                    */
#define _DCDC_CCSTATUS_CLRBSY_DEFAULT                 0x00000000UL                            /**< Mode DEFAULT for DCDC_CCSTATUS              */
#define DCDC_CCSTATUS_CLRBSY_DEFAULT                  (_DCDC_CCSTATUS_CLRBSY_DEFAULT << 0)    /**< Shifted mode DEFAULT for DCDC_CCSTATUS      */
#define DCDC_CCSTATUS_CCRUNNING                       (0x1UL << 1)                            /**< Coulomb Counter Running                     */
#define _DCDC_CCSTATUS_CCRUNNING_SHIFT                1                                       /**< Shift value for DCDC_CCRUNNING              */
#define _DCDC_CCSTATUS_CCRUNNING_MASK                 0x2UL                                   /**< Bit mask for DCDC_CCRUNNING                 */
#define _DCDC_CCSTATUS_CCRUNNING_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for DCDC_CCSTATUS              */
#define DCDC_CCSTATUS_CCRUNNING_DEFAULT               (_DCDC_CCSTATUS_CCRUNNING_DEFAULT << 1) /**< Shifted mode DEFAULT for DCDC_CCSTATUS      */

